#### Terraform Plan

<details><summary>Show Plan</summary>

```
data.aws_region.Region: Reading...
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
data.aws_caller_identity.account: Reading...
aws_iam_role.VotingAppApi_post_selectWinner0_IamRole_3824DF8A: Refreshing state... [id=terraform-20240208163203720100000002]
aws_cloudwatch_log_group.VotingAppApi_get_leaderboard0_CloudwatchLogGroup_80A5B81E: Refreshing state... [id=/aws/lambda/get_leaderboard0-c8bf3988]
aws_dynamodb_table.VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD: Refreshing state... [id=DynamoDBTableAws-4b65a10e]
aws_iam_role.VotingAppApi_get_leaderboard0_IamRole_DE30BD64: Refreshing state... [id=terraform-20240208163203724700000003]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_cloudwatch_log_group.InitializeTable_Function_CloudwatchLogGroup_E746307D: Refreshing state... [id=/aws/lambda/Function-c8e7055b]
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20240208163203695500000001]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_iam_role.VotingAppApi_post_requestChoices0_IamRole_22F6E9E7: Refreshing state... [id=terraform-20240208163203806300000004]
data.aws_caller_identity.account: Read complete after 0s [id=223316951128]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
aws_cloudwatch_log_group.VotingAppApi_post_selectWinner0_CloudwatchLogGroup_FF958712: Refreshing state... [id=/aws/lambda/post_selectWinner0-c8d65bd1]
aws_cloudwatch_log_group.VotingAppApi_post_requestChoices0_CloudwatchLogGroup_679E4CF2: Refreshing state... [id=/aws/lambda/post_requestChoices0-c8820ba5]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=f9yi5t9zj2]
aws_iam_role_policy_attachment.VotingAppApi_get_leaderboard0_IamRolePolicyAttachment_7BB9531C: Refreshing state... [id=terraform-20240208163203724700000003-20240208163204000500000005]
aws_iam_role_policy.VotingAppApi_get_leaderboard0_IamRolePolicy_F06B1AF0: Refreshing state... [id=terraform-20240208163203724700000003:terraform-20240208163217070500000008]
aws_iam_role_policy_attachment.VotingAppApi_post_selectWinner0_IamRolePolicyAttachment_A11AE727: Refreshing state... [id=terraform-20240208163203720100000002-20240208163204033500000006]
aws_iam_role_policy.VotingAppApi_post_selectWinner0_IamRolePolicy_538B4B66: Refreshing state... [id=terraform-20240208163203720100000002:terraform-20240208163217106000000009]
aws_iam_role_policy.VotingAppApi_post_requestChoices0_IamRolePolicy_926B955D: Refreshing state... [id=terraform-20240208163203806300000004:terraform-2024020816321710710000000a]
aws_iam_role_policy_attachment.VotingAppApi_post_requestChoices0_IamRolePolicyAttachment_E91C632D: Refreshing state... [id=terraform-20240208163203806300000004-20240208163204103600000007]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=50b5sq]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-f9yi5t9zj2-prod]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.de1c9ef4a8375c74503133a258fbbc2c.zip]
aws_s3_object.VotingAppApi_post_requestChoices0_S3Object_E5911DA4: Refreshing state... [id=asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.9f0731f99fca5fec261b707cf3c3bc94.zip]
aws_s3_object.VotingAppApi_post_selectWinner0_S3Object_3DCD8E80: Refreshing state... [id=asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.5a54d5293600dc4646c5c7852f7636a3.zip]
aws_s3_object.VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9: Refreshing state... [id=asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.cbdae05830bb4c50d77748d4afa6a2a0.zip]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20240208163203695500000001]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsLICENSEtxt_E95A10E1: Refreshing state... [id=/static/js/main.f35fcf80.js.LICENSE.txt]
aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9css_ABAEC285: Refreshing state... [id=/static/css/main.bc8dc0a9.css]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E2V1QW96MX1WMX]
aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9cssmap_D475E55B: Refreshing state... [id=/static/css/main.bc8dc0a9.css.map]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80js_5A79BA2F: Refreshing state... [id=/static/js/main.f35fcf80.js]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsmap_8EB0B4F9: Refreshing state... [id=/static/js/main.f35fcf80.js.map]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_lambda_function.VotingAppApi_post_selectWinner0_B484847F: Refreshing state... [id=post_selectWinner0-c8d65bd1]
aws_lambda_function.VotingAppApi_get_leaderboard0_6A571716: Refreshing state... [id=get_leaderboard0-c8bf3988]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
aws_lambda_function.VotingAppApi_post_requestChoices0_78C94EF5: Refreshing state... [id=post_requestChoices0-c8820ba5]
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Reading...
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Read complete after 0s [id=3498224767]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20240208163203695500000001]
aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-5969f3af]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2024-02-08T16:32:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:23/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.de1c9ef4a8375c74503133a258fbbc2c.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.a6268c60b5dd4c542cb86525c829f512.zip"
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_get_leaderboard0_6A571716 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_get_leaderboard0_6A571716" {
        id                             = "get_leaderboard0-c8bf3988"
      ~ last_modified                  = "2024-02-08T16:32:23.440+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard0-c8bf3988:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard0-c8bf3988:1/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.cbdae05830bb4c50d77748d4afa6a2a0.zip" -> "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.c3abbafab0452767fa73f1307a970f86.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_post_requestChoices0_78C94EF5 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_post_requestChoices0_78C94EF5" {
        id                             = "post_requestChoices0-c8820ba5"
      ~ last_modified                  = "2024-02-08T16:32:23.660+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices0-c8820ba5:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices0-c8820ba5:1/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.9f0731f99fca5fec261b707cf3c3bc94.zip" -> "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.ad9f50a4e71d5aeb76c300e47046a7e3.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_post_selectWinner0_B484847F will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_post_selectWinner0_B484847F" {
        id                             = "post_selectWinner0-c8d65bd1"
      ~ last_modified                  = "2024-02-08T16:32:23.413+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner0-c8d65bd1:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner0-c8d65bd1:1/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.5a54d5293600dc4646c5c7852f7636a3.zip" -> "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.2d468ff76b03fcee9cb5347adb2b5e32.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      + acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "e7d471d3bdf81c4edb533b9505a9ef03" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.de1c9ef4a8375c74503133a258fbbc2c.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.de1c9ef4a8375c74503133a258fbbc2c.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.a6268c60b5dd4c542cb86525c829f512.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/C8309BBCA83A3B07856BAA92CA998A16/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/A5DE09912E7783EE925E4A452F747D21/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9 must be replaced
-/+ resource "aws_s3_object" "VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9" {
      + acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "d4df528713afaff014b56525b4e0c378" -> (known after apply)
      ~ id                     = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.cbdae05830bb4c50d77748d4afa6a2a0.zip" -> (known after apply)
      ~ key                    = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.cbdae05830bb4c50d77748d4afa6a2a0.zip" -> "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.c3abbafab0452767fa73f1307a970f86.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_get_leaderboard0_Asset_7C98D66C/C714E654B520B0A6CCF10726F82C4E72/archive.zip" -> "assets/VotingAppApi_get_leaderboard0_Asset_7C98D66C/31C984A11C2F5974D445969818068E25/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_post_requestChoices0_S3Object_E5911DA4 must be replaced
-/+ resource "aws_s3_object" "VotingAppApi_post_requestChoices0_S3Object_E5911DA4" {
      + acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "f2ff6a6fd1bda5f1cf664b7e05e6850d" -> (known after apply)
      ~ id                     = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.9f0731f99fca5fec261b707cf3c3bc94.zip" -> (known after apply)
      ~ key                    = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.9f0731f99fca5fec261b707cf3c3bc94.zip" -> "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.ad9f50a4e71d5aeb76c300e47046a7e3.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_post_requestChoices0_Asset_D5F3DEE4/C9416667A0D876D4CD9D56D68C867E7B/archive.zip" -> "assets/VotingAppApi_post_requestChoices0_Asset_D5F3DEE4/DF79A6E30B4C268E8E941D3DCA40E497/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_post_selectWinner0_S3Object_3DCD8E80 must be replaced
-/+ resource "aws_s3_object" "VotingAppApi_post_selectWinner0_S3Object_3DCD8E80" {
      + acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "3baeeb72f7221c316fb124df2b7830b7" -> (known after apply)
      ~ id                     = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.5a54d5293600dc4646c5c7852f7636a3.zip" -> (known after apply)
      ~ key                    = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.5a54d5293600dc4646c5c7852f7636a3.zip" -> "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.2d468ff76b03fcee9cb5347adb2b5e32.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_post_selectWinner0_Asset_C0113166/C09AD5FF24538D5148EC36CE6101C210/archive.zip" -> "assets/VotingAppApi_post_selectWinner0_Asset_C0113166/C3FE1041F72C13A974BE5BF80EC1CE57/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.

```

</details>
